Revit 2027 API
ParameterTypeId.StairsRunCreateAutoLanding Property
 "With Automatic Landing": Built-in param for biding flag for automatic landing creation with Ribbon UI controls
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsRunCreateAutoLanding { get; }
Public Shared ReadOnly Property StairsRunCreateAutoLanding As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsRunCreateAutoLanding {
	ForgeTypeId^ get ();
}
static member StairsRunCreateAutoLanding : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace